W12D2/bench_bnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bob"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ECZMxsNiNESujhlWuDD7MQ"], ["updated_at", "2021-09-21 23:19:06.273386"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save