W11D2/todos/Todo_app/app/controllers/api/todo_items_controller.rb

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: TodoItem.find_by(id: params[:id])

INSERT INTO "todo_items" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test8"], ["body", "test8body"], ["done", false], ["created_at", "2021-09-17 00:21:59.953877"], ["updated_at", "2021-09-17 00:21:59.953877"]]
---
    def create
        @todo = TodoItem.new(todo_item_params)
        if @todo.save

SELECT "todo_items".* FROM "todo_items"
---
    def index
        render json: TodoItem.all

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = $1  [["id", 8]]
---
    def destroy
        @todo = TodoItem.find_by(id: params[:id])
        if @todo
            @todo.destroy