W7D2/music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
    def new
        @band = Band.find_by(params[:band_id])