W7D2/music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @band = Band.find_by(id: params[:band_id])

INSERT INTO "albums" ("band_id", "title", "yr", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["title", "lungs"], ["yr", 2005], ["created_at", "2021-08-18 06:32:53.992276"], ["updated_at", "2021-08-18 06:32:53.992276"]]
---
    def create
        @album = Album.new(album_params)
        if @album.save