W7D2/music_app/app/views/albums/new.html.erb

    <select id="album_band" name="album[band_id]">
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"