W7D5/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id])