W6D5/nine_nine_dresses/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "White"], ["name", "Jett"], ["updated_at", "2021-08-13 23:53:52.324621"], ["id", 2]]